Repository: ramazanov7/kutim
Catalog: lib/src/core/constant/localization/translations/intl_*.arb
Languages: kk, uz

# accountRegister
source: Account Registration
kk: Аккаунт тіркеу
uz: Hisobni ro'yxatdan o'tkazish

source: Add
kk: Қосу
uz: Qo'shish

source: Add photo
kk: Фото қосу
uz: Surat qo'shish

source: Add a photo
kk: Фотосурет қосыңыз
uz: Rasm qo'shing

# add_a_review
source: Add a feedback
kk: Пікір қосу
uz: Fikr-mulohaza qo'shing

source: Add this to the catalog
kk: Санатқа қосу
uz: Buni katalogga qo'shing

# addreview
source: Add a feedback
kk: Пікір қалдыру
uz: Sharh qo'shing

# answer
source: To answer
kk: Жауап беру
uz: Javob bering

source: answers
kk: жауаптар
uz: javoblar

source: Branch
kk: Филиалы
uz: Filial

source: Branch name
kk: Филиалдың атауы
uz: Filial nomi

# calculation_formula_each_like_adds
source: Calculation formula: each like adds +0.1 (maximum 5.0).
kk: Есептеу формуласы: әр ұнату +0.1 (максимум — 5.0) қосады.
uz: Hisoblash formulasi: har bir like + 0.1 qo'shadi (maksimal — 5.0).

source: Camera
kk: Камера
uz: Kamera

source: Cancel
kk: Бас тарту
uz: Bekor qilish

source: Catalog
kk: Каталог
uz: Katalog

source: Category
kk: Санат
uz: Kategoriya

source: Change
kk: Өзгерту
uz: O'zgartirish

source: Choose
kk: Таңдаңыз
uz: Tanlang

source: Choose a city
kk: Қаланы таңдаңыз
uz: Shaharni tanlang

source: City
kk: Қала
uz: Shahar

source: Complain
kk: Шағымдану
uz: Shikoyat qilish

source: Country
kk: Ел
uz: Mamlakat

source: Country and city
kk: Ел және қала
uz: Mamlakat va shahar

source: Country name
kk: Ел атауы
uz: Mamlakat nomi

# createAccount
source: Create an account
kk: Аккаунты құру
uz: Hisob ochish

# createAccountButton
source: Create an account
kk: Аккаунты құру
uz: Hisob ochish

# createYourFirstCard
source: Create your first card and share your impressions
kk: Бірінші картаны жасаңыз және өз әсерлеріңізбен бөлісіңіз
uz: Birinchi kartani yarating va taassurotlaringiz bilan o'rtoqlashing

source: Delete an account
kk: Аккаунты жою
uz: Hisobni o'chirish

# didnot_find_what_you_needed
source: Didn't find what you needed?
kk: Дұрысын таппадыңыз ба?
uz: Kerakli narsani topmadingizmi?

# doNotHaveFeedback
source: You don't have any feedback yet. Leave your feedback!
kk: Сізде әлі пікірлер жоқ. Өз пікіріңізді қалдырыңыз!
uz: Sizda hali sharhlar yo'q. Fikringizni qoldiring!

# doYouHaveAccount
source: Do you already have an account?
kk: Сізде бұрыннан аккаунт бар ма?
uz: Sizda allaqachon hisob bormi?

source: Done
kk: Дайын
uz: Tayyor

source: Edit profile
kk: Профильді өзгерту
uz: Profilni o'zgartirish

source: Edit Profile
kk: Профильді өңдеу
uz: Profilni o'zgartirish

source: Email
kk: Пошта
uz: Pochta

source: English
kk: Ағылшынша
uz: Ingliz

source: Enter new password
kk: Жаңа құпия сөзді енгізіңіз
uz: Yangi parolni kiriting

source: Enter the password
kk: Құпия сөзді енгізіңіз
uz: Parolni kiriting

# enterYourCode
source: Enter the code from your email
kk: Электрондық поштаңыздан кодты енгізіңіз
uz: Pochta kodini kiriting

source: Enter your email address
kk: Поштаны енгізіңіз
uz: Pochtani kiriting

source: Enter your full name
kk: Толық аты-жөнін енгізіңіз
uz: To'liq ismni kiriting

source: Enter your phone number
kk: Телефон нөмірін енгізіңіз
uz: Telefon raqamini kiriting

source: Feedback
kk: Пікір
uz: Ko'rib chiqish

# feedbackLittle
source: feedback
kk: пікір
uz: ko'rib chiqish

source: Filter
kk: Сүзгі
uz: Filtr

source: Find her here and share your impressions
kk: Оны осы жерден тауып, өз әсерлеріңізбен бөлісіңіз
uz: Uni bu erda toping va taassurotlaringiz bilan o'rtoqlashing

source: Find the section you need
kk: Қажетті бөлімді табыңыз
uz: Kerakli bo'limni toping

source: Forgot your password?
kk: Құпия сөзді ұмыттыңыз ба?
uz: Parolni unutdingizmi?

source: Full name
kk: ТАӘ
uz: To'liq ism

source: Gallery
kk: Галерея
uz: Galereya

source: Get code
kk: Кодты алу
uz: Kodni oling

source: Helpdesk
kk: Анықтама үстелі
uz: Yordam xizmati

source: High rating
kk: Жоғары рейтинг
uz: Yuqori reyting

# historyOfMyReview
source: History of my feedback
kk: Менің шолуларымның тарихы
uz: Mening fikrlarim tarixi

source: How is your rating calculated?
kk: Сіздің рейтингіңіз қалай есептеледі?
uz: Sizning reytingingiz qanday hisoblanadi?

# if_you_have_any_questions_or_suggestions
source: If you have any questions or suggestions, please contact our support team â€” we are always happy to help!
kk: Егер сізде сұрақтар немесе ұсыныстар болса, біздің қолдау тобымызға хабарласыңыз-біз әрқашан көмектесуге қуаныштымыз!
uz: Agar sizda biron bir savol yoki taklif bo'lsa, bizning qo'llab — quvvatlash guruhimizga murojaat qiling-biz har doim yordam berishdan mamnunmiz!

# if_you_havenot_found
source: If you haven't found what you need, you can add it to the catalog and leave a review.
kk: Егер сіз дұрысын таппаған болсаңыз, оны каталогқа қосып, пікір қалдыра аласыз.
uz: Agar siz to'g'ri birini topmagan bo'lsangiz, uni katalogga qo'shishingiz va sharh qoldirishingiz mumkin.

source: Image
kk: Сурет
uz: Rasm

source: Incorrect number format
kk: Қате нөмір пішімі
uz: Noto'g'ri raqam formati

# joinInSecond
source: Join in seconds, there's a lot of useful stuff here!
kk: Секунд ішінде қосылыңыз, мұнда көптеген пайдалы заттар бар!
uz: Bir necha soniya ichida qo'shiling, bu erda juda ko'p foydali narsalar bor!

source: Kazakh
kk: Қазақша
uz: Qozoq

source: Language
kk: Тіл
uz: Til

source: Leave feedback
kk: Пікір қалдыру
uz: Fikr qoldiring

# leave_a_review
source: Leave a feedback
kk: Пікір қалдыру
uz: Fikr qoldiring

source: Link to the website
kk: Сайтқа сілтеме
uz: Havola

source: Log out of your account?
kk: Аккаунттан шығу керек пе?
uz: Hisobdan chiqasizmi?

source: Login
kk: Кіру
uz: Tizimga kirish

# loginToAcc
source: Log in to your account
kk: Аккаунтқа кіру
uz: Hisob qaydnomasiga kiring

source: Logout of account
kk: Аккаунттан шығу
uz: Akkauntdan chiqish

source: Main
kk: Басты бет
uz: Bosh sahifa

# minFiveWords
source: Minimum 15 words required
kk: Кемінде 15 сөз қажет
uz: Kamida 15 ta soʻz kerak

# minimum_words
source: Minimum 0/15 words
kk: Кем дегенде 15 сөз қажет
uz: Sizga kamida 15 so'z kerak

source: Name
kk: Атауы
uz: Nomi

source: Name of the city
kk: Қала атауы
uz: Shahar nomi

source: New ones first
kk: Алдымен жаңа
uz: Birinchidan, yangi

source: Next
kk: Келесі
uz: Keyingi

source: No
kk: Жоқ
uz: Yo'q

source: No reviews yet
kk: Әзірге пікірлер жоқ па
uz: Hozircha sharhlar yo'qmi

source: Old ones first
kk: Алдымен ескі
uz: Avval eskilari

source: Password
kk: Құпиясөз
uz: Parol

source: Password recovery
kk: Құпия сөзді қалпына келтіру
uz: Parolni tiklash

# passwordRecoveryText
source: Please create a new password to recover it.
kk: Құпия сөзді қалпына келтіру үшін жаңа құпия сөз жасаңыз.
uz: Iltimos, uni tiklash uchun yangi parol yarating.

source: Phone number
kk: Телефон нөмірі
uz: Telefon raqami

# pleaseDescribeWhatIsWrongWithTheReviewSoThatWeCanDealWithFaster
source: Please describe what is wrong with the review so that we can deal with it faster.
kk: Кері байланыс кезінде не дұрыс емес екенін сипаттаңыз, сонда біз оны тезірек шеше аламыз
uz: Ko'rib chiqishda nima noto'g'ri ekanligini tasvirlab bering, shunda biz uni tezroq hal qila olamiz

# popular_reviews
source: Popular feedback
kk: Танымал пікірлер
uz: Ommabop sharhlar

# popularity_bonus
source: Popularity Bonus: - 50+ likes: each like adds +0.2. - 100+ likes: each like adds +0.3.
kk: Танымалдық бонусы: - 50 + ұнату: әр ұнату + 0.2 қосады. - 100 + ұнату: әр ұнату + 0.3 қосады.
uz: Mashhurlik bonusi: - 50+ yoqtirish: har bir yoqtirish +0.2 qo'shadi. - 100 + yoqtirish: har bir yoqtirish + 0.3 qo'shadi.

source: Profile
kk: Профиль
uz: Profil

source: Pull Down To Refresh
kk: Жаңарту үшін, төмен қарай тартыңыз
uz: Yangilash uchun pastga torting

source: Quantity
kk: Саны
uz: Miqdori

source: Rate this place
kk: Осы жерді бағалаңыз
uz: Bu joyni baholang

source: Rate this place
kk: Бұл жерді бағалаңыз
uz: Bu joyni baholang

# rate_this_place_to_keep_a_review
source: Rate this place to keep a feedback.
kk: Пікірді сақтау үшін осы орынды бағалаңыз.
uz: Fikr-mulohazalarni saqlab qolish uchun ushbu joyni baholang.

source: Rating
kk: Рейтинг
uz: Reyting

source: READ ALL
kk: БАРЛЫҒЫН ОҚЫҢЫЗ
uz: HAMMASINI O'QING

# read_the_entire_review
source: Read the entire feedback
kk: Толық пікірді оқыңыз
uz: Butun sharhni o'qing

# registrationInfo
source: Registration will open access to all the features of the application!
kk: Тіркелу қосымшаның барлық мүмкіндіктеріне қолжетімділікті ашады!
uz: Ro'yxatdan o'tish ilovaning barcha xususiyatlariga kirishni ochadi!

source: Repeat password
kk: Құпия сөзді қайталаңыз
uz: Parolni qayta kiriting

# required_to_fill
source: Required to fill in
kk: Міндетті түрде толтырыңыз
uz: To'ldirish uchun ishonch hosil qiling

# review_history
source: Feedback history
kk: Пікірлер тарихы
uz: Sharhlar tarixi

# reviews
source: Feedbacks
kk: Пікірлер
uz: Sharhlar

# reviewsLittle
source: feedbacks
kk: пікірлер

source: Russian
kk: Орыс тілі
uz: Rus tili

source: Save
kk: Сақтау
uz: Saqlash

source: Search
kk: Іздеу
uz: Izlash

source: Select from gallery
kk: Галереядан таңдаңыз
uz: Galereyadan tanlang

source: Select photo
kk: Фотосуретті таңдаңыз
uz: Fotosuratni tanlang

source: Select a branch
kk: Филиалды таңдаңыз
uz: Filialni tanlang

source: Select a country
kk: Елді таңдаңыз
uz: Mamlakatni tanlang

source: Select a language
kk: Тілді таңдаңыз
uz: Tilni tanlang

source: Select a photo
kk: Фотосуретті таңдаңыз
uz: Fotosuratni tanlang

source: Send
kk: Жіберу
uz: Yuborish

source: Sign up
kk: Тіркелу
uz: Roʻyxatdan oʻtish

source: Subcategory
kk: Ішкі санат
uz: Kichik kategoriya

source: Successfully
kk: Сәтті
uz: Muvaffaqiyatli

source: Successfully updated!
kk: Сәтті жаңартылды!
uz: Muvaffaqiyatli yangilandi!

source: Support Service
kk: Қолдау қызметі
uz: Qo'llab-quvvatlash

source: Take a photo
kk: Суретке түсіру
uz: Suratga oling

# thank_you_for_contacting_us
source: Thank you for contacting us, you are making the world a better place.
kk: Үндеу үшін рахмет, сіз әлемді жақсартасыз
uz: Murojaat qilganingiz uchun tashakkur, siz dunyoni yaxshiroq joyga aylantirasiz

# theRatingUpdate
source: The rating is updated automatically in real time.
kk: Рейтинг нақты уақыт режимінде автоматты түрде жаңартылады.
uz: Reyting Real vaqtda avtomatik ravishda yangilanadi.

# the_base_rating_starts_from
source: The base rating starts from 1.0.
kk: Базалық рейтинг 1.0-ден басталады.
uz: Asosiy reyting 1.0 dan boshlanadi.

# they_are_discussing_it_now
source: They're discussing it now
kk: Қазір талқылануда
uz: Hozir muhokama qiling

source: Update!
kk: Жаңарту!
uz: Yangilash!

# upload_a_photo
source: Upload a photo of the product in high quality, without extraneous signs and labels.
kk: Өнімнің фотосуретін жақсы сапада жүктеңіз, ешқандай белгілер мен жазулар жоқ болсын.
uz: Mahsulot fotosuratini sifatli, begona belgilar va yozuvlarsiz yuklang.

source: User photos
kk: Пайдаланушылардың суреттері
uz: Foydalanuvchi fotosuratlari

source: Uzbek
kk: Өзбек тілі
uz: О'zbek

source: View
kk: Көру
uz: Ko'ring

# weHaveSent
source: We have sent a confirmation code to your email address
kk: Біз сіздің электрондық пошта мекенжайыңызға растау кодын жібердік
uz: Biz sizning elektron pochta manzilingizga tasdiqlash kodini yubordik

source: words
kk: сөз
uz: so'z

source: Write ...
kk: Жазыңыз ...
uz: Yozing ...

# writeReview
source: Write a review...
kk: Пікір жазыңыз...
uz: Sharh yozing...

# write_a_review
source: Write a feedback
kk: Пікір жазыңыз
uz: Sharh yozing

source: Yes, get out
kk: Иә, шығамын
uz: Ha, chiqing

# yourRating
source: Your rating increases the credibility and visibility of your reviews! ðŸ˜Š
kk: Сіздің рейтингіңіз сіздің пікірлеріңіздің сенімділігі мен көрінуін арттырады! 😊
uz: Sizning reytingingiz fikr-mulohazalaringizning ishonchliligi va ko'rinishini oshiradi! 😊

# your_rating_depends_on_the_number
source: Your rating depends on the number of likes under your feedback: the more likes, the higher the rating!
kk: Сіздің рейтингіңіз сіздің пікірлеріңіздің астындағы ұнатулар санына байланысты: ұнатулар неғұрлым көп болса, рейтинг соғұрлым жоғары болады!
uz: Sizning reytingingiz sharhlaringiz ostidagi yoqtirishlar soniga bog'liq: yoqtirishlar qancha ko'p bo'lsa, reyting shunchalik yuqori bo'ladi!

source: Your response to the comment
kk: Сіздің пікірге жауап
uz: Sharhga javobingiz
